bmalbusca/ES_pic16f_eCOS/project_part_1/main.c
/* 
 * 
 *  ALERT - MUDEI A FREQ DO TIMER 1 PARA FICAR MAIS RAPIDO
 *      NECESSARIO ALTERAR 
 *
 *  NOTE - KEYWORD PARA ALTERACOES 
 */

#include <xc.h>
#include "mcc_generated_files/mcc.h"
#include "eeprom_rw.h"
#include "I2C/i2c.h"
#include "leds.h" 
#include "defines.h"
#include "uartusr.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define NREG 30
#define PMON 5
#define TALA 3
#define ALAT 100
#define ALAL 2
#define ALAF 0
#define CLKH 0
#define CLKM 0

#define ON 1
#define OFF 0
#define SET 2

#define FIELD 0
#define SUBFIELD 1

#define NONE -1
#define MIN_TIME -1

#define TIMER_MS_RESET 200
#define DEBNC_TIME 15


#define UART_BUFF_SIZE 16


/*******************************************
 *  Desc: Protos
 *******************************************/

volatile int value = 0;
void handler_clock_hms(void);
void handler_clock_ms(void);
void copyto_EEPROM(void);

unsigned int ADC_read(void);
void recAlarm(unsigned char _value);
void recMinutes(unsigned char _value);
void recHour(unsigned char _value);
unsigned char limitTempThreshUnits(void);
unsigned char limitHoursUnits(void);
void recTempThresh(unsigned char _value);
void recLumThresh(unsigned char _value);
unsigned char increment_subfield(unsigned char limit, unsigned init_val);
void parse_message(char * message, uint8_t max_size);

unsigned char checkDebounceSW1();
unsigned char checkDebounceSW2();

void clock_field(void);
void config_routine(void);
void selectSubfield(void);
void getSubfieldInfo(void);
void save_recovery_params(void);
void check_thresholds(uint8_t threshold);

typedef unsigned char udch;
void ring_buffer (udch * _ring_byte, udch clock_h, udch  clock_m, udch  clock_s,udch tem, udch lum);



/*******************************************
 *  Desc: Global Variables
 *******************************************/

volatile unsigned char clkh = CLKH;
volatile unsigned char clkm = CLKM;
volatile unsigned char seg;
volatile unsigned char clkms = 0;


unsigned int hours_tens =0; // 0 -23
unsigned int hours_units =0;
unsigned int min_tens =0; //0 -59
unsigned int min_units =0;

volatile unsigned char alarm_told = 0, alarm_t =0;


unsigned char nreg_init;
unsigned char ring_byte[5];

unsigned char last_ms = 0;
unsigned char last_ms2 = 0;
volatile unsigned char last5s =0, last1m=0;

unsigned int mode_field_subfield[2]= {NONE,NONE};
volatile unsigned char set_mode = 0;
volatile unsigned char config_mode = OFF;
volatile unsigned char alarm = 0;

char str_rc[UART_BUFF_SIZE]="\0";
char str_snd[UART_BUFF_SIZE]="\0";
char buff_reg[5]="\0";


unsigned int convertedValue = 0;
unsigned int duty_cycle = 0;

unsigned int lum_bin = 0;
unsigned int threshold = 0;

unsigned char temp;
unsigned char alaf;
unsigned char nreg = NREG;
unsigned char nreg_pt;
unsigned int nreg_read = 0;
unsigned char reg_valid =0; 
unsigned char pmon = PMON;
unsigned char tala = TALA;

const unsigned char num_subfields[5] = {0,4, 1, 2, 1};
unsigned char temp_thresh = ALAT;
unsigned char lum_thresh = ALAL;


/*******************************************
 *  Desc: External Interrupt
 *******************************************/
void sw1_EXT(void){

    if(checkDebounceSW1()){
        if (alarm == ON){                   // Turn off the alarm 
            alarm = OFF;
            PWM6_LoadDutyValue(OFF); 
            last_ms = clkms;
        }
        else{
            if(config_mode == OFF){
                config_mode = ON;           // NOTE after changing to Configure mode disable the EXT interrupt and only check if is pressed at main loop        
            }                   // for not overloading the interrupt vector ISR            
        }
    }
}




/*******************************************
 *  Desc: Timer 0 interrupt
 *******************************************/
void ISR_3s(void){

    if (threshold){     //check if we still have a issue
        PWM6_LoadDutyValue(1023);
        alarm = ON;

    }

    TMR0_StopTimer();
    PIE0bits.TMR0IE = 0;

}


/*******************************************
 *  Desc: Main fucntion
 *******************************************/


void main(void){

    SYSTEM_Initialize();
    TMR0_SetInterruptHandler(ISR_3s);
    TMR1_SetInterruptHandler(handler_clock_hms);
    INT_SetInterruptHandler(sw1_EXT);
    TMR2_SetInterruptHandler(handler_clock_ms);

    //variables initialization
    
    unsigned char t5s =0, t1m =0;
    
    
    nreg = (unsigned char) (EE_FST + 5 * NREG >= EE_RECV ? EE_SIZE : 5 * NREG);
    nreg_pt = 0;
    nreg_read = 0;
    nreg_init = 0;
    alaf = 1;
    temp = 0;
    lum_bin = 0;
    threshold = 0;
    duty_cycle = 0;
    set_mode= OFF;
    
    //I2C 
    i2c1_driver_open();
    I2C_SCL = 1;
    I2C_SDA = 1;
    WPUC3 = 1;
    WPUC4 = 1;

    //recover data from EEPROM
    recoverData();

    PWM6_LoadDutyValue(OFF);
    alarm = OFF ;
    IO_RB4_SetPullup();                                 //Help debouncing 

    // Enable the Global Interrupts
    INTERRUPT_GlobalInterruptEnable();
    // Enable the Peripheral Interrupts
    INTERRUPT_PeripheralInterruptEnable();
     
    
    while (1)
    {   

        //SLEEP();                //sleep mode
        NOP();

         if(EUSART_is_rx_ready()){
            if (read_str_UART(str_rc, UART_BUFF_SIZE)>1){
                parse_message(str_rc, UART_BUFF_SIZE);  
            }
             
         }

    
        PIE4bits.TMR1IE = 0;    //race condition - disable interrupt
        t5s = last5s;
        PIE4bits.TMR1IE = 1;

        if(t5s >= pmon){ 
            PIE4bits.TMR1IE = 0;
            last5s =0; 
            PIE4bits.TMR1IE = 1;  

            do{       
                    if(!config_mode){

                            convertedValue = ADC_read();        //read potentiometer
                            lum_bin = (convertedValue >> 8);    //convert into 4 levels
                            LED_bin(lum_bin);                   //LED representation


                            NOP();
                            temp = tsttc();                     //I2C read
                            NOP();
                            
                            // Push to Ring buffer
                            if (temp != read_ring(nreg_pt, nreg, nreg_init, 0, 3) || lum_bin != read_ring(nreg_pt, nreg, nreg_init, 0, 4)) {
                                ring_buffer (ring_byte,clkh, clkm, seg, temp,lum_bin);
                                push_ring(&nreg_pt, nreg, &nreg_init, ring_byte);
                                DATAEE_WriteByte(EE_RECV + 4, nreg_pt);
                                cksum_w();
                            }


                            threshold = (lum_bin > lum_thresh || temp > temp_thresh  ) & alaf;   //detect alarm 
                            check_thresholds(threshold);
                            

