bmalbusca/ES_pic16f_eCOS/project_part_1/main.c
                    }

                    else if(config_mode == ON){

                        EXT_INT_InterruptDisable(); 
                        config_routine();
                        EXT_INT_InterruptEnable(); 
                        DATAEE_WriteByte(EE_RECV + 5, temp_thresh);
                        DATAEE_WriteByte(EE_RECV + 6, lum_thresh);
                    }

                    __delay_ms(10);

            }while(alarm == SET);
            
        }
   
       PIE4bits.TMR1IE = 0;
       t1m = last1m;
       PIE4bits.TMR1IE = 1;
       
       if (t1m  >= 1) {
         save_recovery_params();
       }
    
    }

}



void check_thresholds(uint8_t threshold){
    
    unsigned char _alarm;
   
    PIE4bits.TMR2IE = 0;
    _alarm = alarm;
    PIE4bits.TMR2IE = 1;
    
    
    if(threshold){
            if(_alarm == SET){           //if alarm is set ON you need to press SW1 ON 
                duty_cycle +=1 ;   
                PWM6_LoadDutyValue(duty_cycle);
            }
            else if(_alarm == OFF){
                //PIE0bits.TMR0IE = 1;    // We exceed the threshold  check the 3 sec 
                //TMR0_StartTimer();
                _alarm = SET ;  
            }
        }
    else{
        if(_alarm == SET){
            PWM6_LoadDutyValue(OFF);
            _alarm = OFF ;
        }
    }
    
}





/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/


 void config_routine(void){
    
    unsigned int select_mode =0;
    last_ms = clkms;
    last_ms2 = clkms;
    
    do{
        if(mode_field_subfield[FIELD] == NONE && select_mode == 0){             
            all_LED();
        } 

        if(!IO_RB4_GetValue()){       
            if(checkDebounceSW1()){

                select_mode +=1;

                switch(select_mode){            
                    case 1: mod1_LED();break;
                    case 2: mod2_LED();break;
                    case 3: mod3_LED();break;
                    case 4: mod4_LED();break;
                    default: select_mode = 0; config_mode = OFF; alarm = OFF;   // NOTE Enable EXT interrupt or at that moment when the pic is moving to normal operation
                    break;

                }   
            }
        }
                

        if(!IO_RC5_GetValue()){
            if(checkDebounceSW2()){                
                mode_field_subfield[FIELD] = select_mode;
                mode_select_LED();      // notice the select was done  
                selectSubfield();
            }
        }
        
        __delay_ms(2);
        
    }while(config_mode == ON);  
    
    mode_field_subfield[FIELD] = NONE;
    mode_field_subfield[SUBFIELD] = NONE;
    
}
/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/

void selectSubfield(void){ // o clock tem 4 subfields
    unsigned int  subfield = 1;

 
    do{
        if(!IO_RB4_GetValue()){
            if(checkDebounceSW1()){
                subfield +=1;
            }

        }
                
        mode_LED( subfield);

        if(!IO_RC5_GetValue()){             // Select operation
            if(checkDebounceSW2()){
                mode_field_subfield[SUBFIELD] = subfield;
                getSubfieldInfo();
                all_LED();                  // indication of subfield selection 
            }

        }
        
        __delay_ms(2);
        
    }while(subfield <= num_subfields[mode_field_subfield[FIELD]]);  

     
}

/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/
void getSubfieldInfo(void){

    unsigned char h_tens, h_units, m_tens, m_units, temp_thresh_tens, temp_thresh_units;
    
    switch(mode_field_subfield[FIELD]){
        case 1: 
            PIE4bits.TMR1IE = 0;
            h_tens = clkh / 10;
            h_units = clkh % 10;
            m_tens = clkm / 10;
            m_units = clkm % 10;
        
            switch(mode_field_subfield[SUBFIELD]){
                case 1:                             //Hour tens
                    h_tens = increment_subfield(2, h_tens);
                    break;
                case 2:                             //Hour units
                    h_units = increment_subfield( limitHoursUnits() , h_units);
                    break;
                case 3:                             //minutes tens
                    m_tens = increment_subfield( 5 , m_tens);
                    break;
                case 4:                             //minutes units
                    m_units = increment_subfield( 9, m_units);
                        break;
        
            }
            clkh = 10*h_tens + h_units;
            clkm = 10*m_tens + m_units;
            PIE4bits.TMR1IE = 0;
        break;
        //------------------------
        case 2:
            alaf = increment_subfield( 1, alaf );   
    break;
        //------------------------
        case 3:
            temp_thresh_tens = temp_thresh / 10;
            temp_thresh_units = temp_thresh % 10;
            switch(mode_field_subfield[SUBFIELD]){
                case 1:                             //Temperature Thresh tens
                    temp_thresh_tens = increment_subfield(5, temp_thresh_tens);
                break;
                case 2:                             //Temperature Thresh units
                    temp_thresh_units = increment_subfield(limitTempThreshUnits(), temp_thresh_units);
                break;
            }
            temp_thresh = 10*temp_thresh_tens + temp_thresh_units;
        break;
        //------------------------
        case 4: 
            lum_thresh = increment_subfield(3, lum_thresh);
        break;
    }
}

/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/


