bmalbusca/ES_pic16f_eCOS/project_part_1/main.c
void recLumThresh(unsigned char _value){
    lum_thresh = _value;
}

void recTempThresh(unsigned char _value){
    if(mode_field_subfield[SUBFIELD] == 1){     //Se tivermos a mudar temp thresh tens
        
        temp_thresh = _value + (temp_thresh % 10);            //tens + units
        
    }else{                                      //Se tivermos a mudar temp units
        temp_thresh = (temp_thresh / 10) + _value;            //tens + units
    }
}


/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/


unsigned char limitTempThreshUnits(){
     if((temp_thresh / 10) == 5){       //Se os tens das horas s?o 2, o limite de unidades ? 3 
        return 0;
    }else{
        return 9;
    }
}

/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/


unsigned char limitHoursUnits(){
    //n ? preciso disable do interrupt do clock
    if((clkh / 10) == 2){       //Se os tens das horas s?o 2, o limite de unidades ? 3 
        return 3;
    }else{
        return 9;
    }
}

unsigned char increment_subfield(unsigned char limit, unsigned init_val){  //funcao universal para todos os subfields

    unsigned char exit = 0;
    unsigned char _value = init_val;

    PWM6_LoadDutyValue(0);
    LATA = 0;
    
    if(_value > limit) _value = 0;

    while(exit == 0){
        representLed(_value);
        if(!IO_RC5_GetValue()){
            if(checkDebounceSW2()){
                _value++;
                if(_value > limit) _value = 0;
            }
            last_ms2 = clkms;
        }

        if(!IO_RB4_GetValue()){
            if(checkDebounceSW1()){
                exit = 1;
            }
            last_ms = clkms;
        }
    }
return _value;  
}

/*******************************************
 *  Func: ADC_read
 *  Desc: Read the RB4 port
 *  Obs:  ADC()
 *******************************************/

unsigned int ADC_read(void){

    ADCC_StartConversion(channel_ANA0);
    while(!ADCC_IsConversionDone()){
        __delay_ms(1);
    }

    return ADCC_GetConversionResult();
}

/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/

void handler_clock_hms(void){

    if(!config_mode){
        IO_RA7_Toggle();
    }
    
   
    alarm_t++;
    last5s++;
    seg++;
    if(seg >= 60) {
        clkm++;
        last1m++;
        seg = 0;
        if(clkm >= 60) {
            clkh++;
            clkm = 0;
        }
    }
    
    if(clkh > 24){
        clkh =0;
    }

}

/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/

void handler_clock_ms(void){   
    clkms++;
    
    if (threshold){     //check if we still have a issue
       
        if (  alarm_t - alarm_told  > tala  ){
            alarm_t =0;
            alarm_told =0;
            PWM6_LoadDutyValue(1023);
            alarm = ON;
        }
    }
    else{
         alarm_told = alarm_t;
    }
    
    alarm_t++;

    if(clkms > TIMER_MS_RESET){
        clkms = 0;
    }
}



void parse_message(char * message, uint8_t max_size){
    uint8_t i,h,m,s,p,t;
    uint8_t  T,L,a,n,idx;
    char c = '0', cmd =message[1] ;
    
    switch (cmd)
    {
     case (char)RCLK : 
        reply_UART_OK((char)cmd);
        PIE4bits.TMR1IE = 0;
        
        //sprintf(str_snd, "%c%c%02i%02i%02i%c", SOM,cmd,clkh,clkm,seg,(char)EOM);
        //write_str_UART(str_snd ,UART_BUFF_SIZE);
        
        
        printf("%c%c%02i%02i%02i%c",(char)SOM,(char)cmd, clkh,clkm,seg,(char)EOM );
        
        //write_UART((char)SOM);
        //write_UART((char)cmd);
        //write_UART('1');
        //write_UART('2');
        //write_UART(c);
        //write_UART((char)EOM);
        
        PIE4bits.TMR1IE = 1;
        
        break;
    
    case (char)SCLK:
        
        if ((strlen(message)) >= 5 ){ 
            h = message[2] -'0';
            m = message[3] - '0';
            s = message[4] - '0';
            
            if (( h >= 0 && h <24) && (m >=0 && m < 60 ) && ( s>=0 && s<60) ){
                PIE4bits.TMR1IE = 0;
                clkh = h;
                clkm = m;
                seg = s;
                PIE4bits.TMR1IE = 1;
                reply_UART_OK((char)cmd);
            }
            else{
                reply_UART_ERROR((char)cmd);  
            } 
        
        }
        else{
            
            reply_UART_ERROR((char)cmd);
        }
        
        break;
    case (char)RTL:
        reply_UART_OK((char)cmd);
        printf("%c%c %i %i %c",(char)SOM,(char)cmd,temp,lum_bin,(char)EOM );
        
        //write_UART((char)SOM);
        //write_UART((char)cmd);
        //write_UART((char)temp);
        //write_UART((char)lum_bin);
        //write_UART((char)EOM);
        break;
    case (char)RPAR:
        reply_UART_OK((char)cmd);
        printf("%c%c %i %i %c",(char)SOM,(char)cmd,pmon,tala,(char)EOM );
        
        write_UART((char)SOM);
        write_UART((char)cmd);
        write_UART((char)pmon);
        write_UART((char)tala);
        write_UART((char)EOM);
        break;
    case (char)MMP:
            
            if ((strlen(message)) >= 3 ){ 
                p = message[2] -'0';
               
                if (( p >= 0 && p <100)  ){
                 pmon = p  ; 
                 reply_UART_OK((char)cmd);
                }
                else{
                    reply_UART_ERROR((char)cmd);  
                } 
            }
            else{
                
                reply_UART_ERROR((char)cmd);
            }
        break;
    case (char) MTA:
      if ((strlen(message)) >= 3 ){ 
                t = message[2] -'0';
                if (( t >= 0 && t<61)){
                 tala = t ;
                 reply_UART_OK((char)cmd);
                 
