bmalbusca/ES_pic16f_eCOS/project_part_1/main.c
                }
                else{
                    reply_UART_ERROR((char)cmd);  
                } 
            }
            else{              
                reply_UART_ERROR((char)cmd);
        }
        break;
    case (char) RALA:
        reply_UART_OK((char)cmd);
        printf("%c%c %i %i %c",(char)SOM,pmon,tala,(char)EOM );
        
        write_UART((char)SOM);
        write_UART((char)cmd);
        write_UART((char)temp_thresh);
        write_UART((char)lum_thresh);
        write_UART((char)EOM);
        break;
    case (char)DATL:
        if ((strlen(message)) >= 4 ){ 
                T = message[2] -'0';
                L = message[3] -'0';
               
                if (( T >= 0 && T <51) && ( L >= 0 && L<4)  ){
                 temp_thresh = T ;
                 lum_thresh = L;
                 reply_UART_OK((char)cmd);
                }
                else{
                    reply_UART_ERROR((char)cmd);  
                } 
            }
            else{
                
                reply_UART_ERROR((char)cmd);
        }
        break;
    case (char)AALA:
        if ((strlen(message)) >= 3 ){ 
                a = message[2] -'0';
                if (( a == 0 || a == 1)){
                 alaf = a ;
                 reply_UART_OK((char)cmd);
                 
                }
                else{
                    reply_UART_ERROR((char)cmd);  
                } 
            }
            else{              
                reply_UART_ERROR((char)cmd);
        }
        break;
    case (char)IREG:
        
        reply_UART_OK((char)cmd);
        printf("%c%c %i %i %i %c",(char)SOM,(char)cmd,reg_valid,nreg_read,nreg,nreg_pt,(char)EOM );
        
        //write_UART((char)SOM);
        //write_UART((char)cmd);
        //write_UART((char)nreg);
        //write_UART((char)reg_valid);
        //write_UART((char)nreg_read);
        //write_UART((char)nreg_pt);
        //write_UART((char)EOM);
        break;
    case (char)TRGC:
        
         if ((strlen(message)) >= 3 ){ 
                n = message[2] -'0';
                if (( n >= 0 && n< nreg)){
                    
                             
                    reply_UART_OK((char)cmd);
                 for(int j=0; i < n; ++i){
                    if (read_registers(buff_reg, 0) >4 ){
                        
                        write_UART((char)SOM);
                        write_UART((char)cmd);
                        write_UART(buff_reg[0]);
                        write_UART(buff_reg[1]);
                        write_UART(buff_reg[2]);
                        write_UART(buff_reg[3]);
                        write_UART(buff_reg[4]);
                        write_UART((char)EOM);
                    }
                  
                  }
                }
                else{
                    reply_UART_ERROR((char)cmd);  
                } 
            }
            else{              
                reply_UART_ERROR((char)cmd);
        }
        
        break;
    case (char)TRGI:
        
        if ((strlen(message)) >= 4 ){ 
                n = message[2] -'0';
                idx = message[2] -'0';
                if (( n >= 0 && n< nreg)  && (idx >= 0 && idx< nreg)){
                    
                             
                    reply_UART_OK((char)cmd);
                 for(int j=0; i < n; ++i){
                    if (read_registers(buff_reg, idx) >4 ){
                        
                        write_UART((char)SOM);
                        write_UART((char)cmd);
                        write_UART(buff_reg[0]);
                        write_UART(buff_reg[1]);
                        write_UART(buff_reg[2]);
                        write_UART(buff_reg[3]);
                        write_UART(buff_reg[4]);
                        write_UART((char)EOM);
                    }
                    idx =0; 
                  
                  }
                }
                else{
                    reply_UART_ERROR((char)cmd);  
                } 
            }
            else{              
                reply_UART_ERROR((char)cmd);
        }
        
        
        
        break;
    case (char)NMFL:
        break;
    default:
        reply_UART_ERROR((char)CMD_ERROR);
        
    }

}



/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/

unsigned char checkDebounceSW1(){
    PIE4bits.TMR1IE = 0;

    if(clkms - last_ms < 0){       // clkms deu reset

        if ((TIMER_MS_RESET - last_ms)+ clkms > DEBNC_TIME ){
            last_ms = clkms;
            PIE4bits.TMR1IE = 1;
            return 1;
        }
    }

    if(clkms - last_ms < DEBNC_TIME){
        return 0;
        PIE4bits.TMR1IE = 1;
    }else{
        last_ms = clkms;
        PIE4bits.TMR1IE = 1;
        return 1;
    }
}

/*******************************************
 *  Func: all_LED
 *  Desc: Blink all LEDs
 *  Obs: 
 *******************************************/


unsigned char checkDebounceSW2(){
    //Fazer disable interrupt clkms

    if(clkms - last_ms2 < 0){       // clkms deu reset

        if ((TIMER_MS_RESET - last_ms2)+ clkms > DEBNC_TIME ){
            last_ms2 = clkms;
            return 1;
        }
    }

    if(clkms - last_ms2 < DEBNC_TIME){
        return 0;
    }else{
        last_ms2 = clkms;
        return 1;
    }
}

/* Write Recovery Parameters */
void save_recovery_params(){
        
    unsigned char aux, aux1;
    PIE4bits.TMR1IE = 0;  
    last1m = 0;
    aux = clkh;
    aux1 = clkm;
    PIE4bits.TMR1IE = 1;
    DATAEE_WriteByte(EE_RECV + 1, aux);
    DATAEE_WriteByte(EE_RECV + 2, aux1);
    cksum_w();

    
}

void ring_buffer (unsigned char * _ring_byte, unsigned char clock_h, unsigned char clock_m, unsigned char clock_s, unsigned char tem,unsigned char lum){

    PIE4bits.TMR1IE = 0;        
    _ring_byte[0] = clock_h;
    _ring_byte[1] = clock_m;
    _ring_byte[2] = clock_s;
    PIE4bits.TMR1IE = 1; 
    _ring_byte[3] = tem;
    _ring_byte[4] = lum;
}
               



